//**************************************************************************** /
//                                                                            */
//                        #' ,#,    #    #  #.  .`#  #==,    .*.  + + +       */
// ~~~CREATED~~~         #  #   #  # #  #  # *.* #  #   #   *._.*    +        */
// ~~~~~BY~~~~~~    #. .#  #   #  #   ##  #     #  #  ,#    ,' ',   +         */
// ~<<jonmd87>>~     ###    '#'  #    #  #     #  #==*       *.*   +          */
//                                                                            */
//**************************************************************************** /
//
//
// Требуется создать программу которая расчитывает расход горючего,
// в двух режимах европейском и режиме США, то есть 
// [0] режим европейский (в литрах на 100 км)
// [1] режим США ( в милях на один галлон горючего)
// [-1] выход из программы 
// Если введено число отличающееся от 0, 1 и -1
// программа произведет рассчеты по режиму выбранному в 
// последний раз
// 1 галлон США = 3.785411784 литра.
// 1 миля сухопутная США = 1.60934 километра.

#include <unistd.h>
#include <stdio.h>

#include "12.2.h"

int 	main ()
{
	int		mode;

	ft_putstr("============================\n");
	ft_putstr("[0] euro(litr/km)\n[1] usa (miles/gallons)\n[-1] exit\n");
	ft_putstr("============================\n");
	ft_putstr("choose the mode\n");
	scanf("%d", &mode);
	while (mode != -1)
	{
		set_mode(&mode);
		get_info();
		show_info();
		ft_putstr("\n\n========================\n");
		ft_putstr("[0] euro(litr/km)\n[1] usa (miles/gallons)\n[-1] exit\n");
		ft_putstr("========================\n");
		ft_putstr("choose the mode\n");
		scanf("%d", &mode);
	}
	ft_putstr("GOOD BUY!!!\n");
	return (0);
}
